src/Documents/ПереводМеждуСчетами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПереводМеждуСчетами</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Бюджет</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиНаСчетах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СчетОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиНаСчетах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНаСчетах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ПереводМеждуСчетами/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНаСчетахОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНаСчетах.Остатки(, Счет = &СчетОтправитель) КАК ОстаткиНаСчетахОстатки";	
	Запрос.УстановитьПараметр("СчетОтправитель", СчетОтправитель);	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();	
	ТекущийОстаток = 0;
	Если Выборка.Следующий() Тогда
		ТекущийОстаток = Выборка.СуммаОстаток;
	КонецЕсли;	
	Если ТекущийОстаток < Сумма Тогда
		Отказ = Истина;
		Сообщить("Недостаточно средств на счете-отправителе! Доступный остаток: " + ТекущийОстаток + ", попытка перевода: " + Сумма);
		Возврат;
	КонецЕсли;
	Движения.ОстаткиНаСчетах.Записывать = Истина;
	ДвижениеСписания = Движения.ОстаткиНаСчетах.Добавить();
	ДвижениеСписания.ВидДвижения = ВидДвиженияНакопления.Расход;
	ДвижениеСписания.Период = Дата;
	ДвижениеСписания.Счет = СчетОтправитель;
	ДвижениеСписания.Сумма = Сумма;
	ДвижениеЗачисления = Движения.ОстаткиНаСчетах.Добавить();
	ДвижениеЗачисления.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеЗачисления.Период = Дата;
	ДвижениеЗачисления.Счет = СчетПолучатель;
	ДвижениеЗачисления.Сумма = Сумма;
КонецПроцедуры
